const arrayOfQuotes = [
  {
    author: "المتنبى",
    quote: `يَا مَـنْ يَعِـزّ عَلَيْنَـا أنْ نُفَارِقَهُـمْ
    وَجدانُنا كُلَّ شـيءٍ بَعدَكـمْ عَـدَمُ
    مَا كـانَ أخلَقَنَـا مِنكُـمْ بتَكرِمَـةٍ
    لَـوْ أنّ أمْرَكُـمُ مِـن أمرِنَـا أمَـمُ`,
  },
  {
    author: "عمرو بن كلثوم",
    quote: `أَلا هُبّي بِصَحنِكِ فَاَصبَحينا
    وَلا تُبقي خُمورَ الأَندَرينا
    مُشَعشَعَةً كَأَنَّ الحُصَّ فيها
    إِذا ما الماءُ خالَطَها سَخينا`,
  },
  {
    author: "عمرو بن كلثوم",
    quote: `أَبا هِندٍ فَلا تَعَجَل عَلَينا
      وَأَنظِرنا نُخَبِّركَ اليَقينا
      بِأَنّا نورِدُ الراياتِ بيضاً
      وَنُصدِرُهُنَّ حُمراً قَد رَوينا
      وَأَيّامٍ لَنا غُرٍّ طِوالٍ
      عَصَينا المَلكَ فيها أَن نَدينا`,
  },
  {
    author: "امرؤ القيس",
    quote: `فَهِي هِي وهِي ثمَّ هِي هِي وهي وَهِي
   مُنىً لِي مِنَ الدُّنيا مِنَ النَّاسِ بالجُمَل
   أَلا لا أَلَا إِلَّا لآلاءِ لابِثٍ
   ولا لَا أَلَا إِلا لِآلاءِ مَن رَحَل
   فكَم كَم وكَم كَم ثمَّ كَم كَم وكَم وَكَم
   قَطَعتُ الفَيافِي والمَهَامِهَ لَم أَمَل
   وكافٌ وكَفكافٌ وكَفِّي بِكَفِّهَ
   وكافٌ كَفُوفُ الوَدقِ مِن كَفِّها انهَمل`,
  },
  {
    author: "الإمام الشافعي",
    quote: `فإذا كنت في الشدائد لا تجزع ... فإن الذي يحمي الظهر من الرماح`,
  },
  {
    author: "أبو الطيب المتنبي",
    quote: `التَحَفُّظُ عَنْ مُرَافَقَةِ الأَثَرِ إِذَا خَافَ الإِنْسَانُ أَنْ يَخُونَا`,
  },
];



function changeQoute() {

  const randomIndex = Number.parseInt(Math.random() * arrayOfQuotes.length + 1);
  var qoute = document.getElementById("qoute");
  var qouteWriter = document.getElementById("qoute-writer");

  qoute.innerText = arrayOfQuotes[randomIndex].quote;
  qouteWriter.innerText = arrayOfQuotes[randomIndex].author;
}

window.onload = function() {
  changeQoute();
};


